interface NewsItem {
  id: number
  title: string
  date: string
  description: string
  image: string
  isFeatured?: boolean
}

export const newsData: NewsItem[] = [
  {
    id: 1,
    title:
      "منشآت تختتم أسبوع القانون بمناقشة أهم الفرص الواعدة لرواد الأعمال في قطاع القانون",
    date: "01.06.2024 07:54 صباحًا",
    description:
      'كشفت الهيئة العامة للمنشآت الصغيرة والمتوسطة "منشآت" عن باب الامتياز التجاري ضمن فعاليات ملتقى بيبان 24، الذي يقام تحت شعار "وجهة عالمية للفرص" خلال الفترة من 5 إلى 9 نوفمبر في واجهة الرياض…',
    image: "/Post.svg",
    isFeatured: true,
  },
  {
    id: 2,
    title: "منشآت تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة",
    date: "الجمعة 26 يوليو 2024",
    description:
      "تطلق منشآت جولة الامتياز التجاري في 14 مدينة ومحافظة حول المملكة...",
    image: "/news-1.svg",
  },
  {
    id: 3,
    title: "منشآت تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة",
    date: "الجمعة 26 يوليو 2024",
    description:
      "تطلق منشآت جولة الامتياز التجاري في 14 مدينة ومحافظة حول المملكة...",
    image: "/news-2.svg",
  },
  {
    id: 4,
    title: "منشآت تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة",
    date: "الجمعة 26 يوليو 2024",
    description:
      "تطلق منشآت جولة الامتياز التجاري في 14 مدينة ومحافظة حول المملكة...",
    image: "/news-3.svg",
  },
]
