"use server"

import { ApprovalRequest } from "@types"

export const getApprovalRequests = async () => {
  return dummyData
}

// ? Modify ApprovalRequest type
const dummyData: ApprovalRequest[] = [
  {
    id: "#55965",
    description: "طلب تنفيذ",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55964",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55963",
    description: "دورة تدريبية خارجية لمدة 3 أيام",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55962",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55961",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55960",
    description: "إجازة سنوية لمدة 24 يوم",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55959",
    description: "طلب نقل العمل للموظف بنت عبد العزيز الباشر",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55958",
    description: "طلب إجازة مرضية",
    date: "2024-05-04 - 14:30:00",
  },
  {
    id: "#55957",
    description: "طلب ترقية",
    date: "2024-05-04 - 10:15:00",
  },
  {
    id: "#55956",
    description: "طلب تدريب داخلي",
    date: "2024-05-03 - 09:45:00",
  },
  {
    id: "#55955",
    description: "طلب تنفيذ",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55954",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55953",
    description: "دورة تدريبية خارجية لمدة 3 أيام",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55952",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55951",
    description: "إدارة المكافآت والترقيات",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55950",
    description: "إجازة سنوية لمدة 24 يوم",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55949",
    description: "طلب نقل العمل للموظف بنت عبد العزيز الباشر",
    date: "2024-05-05 - 04:30:00",
  },
  {
    id: "#55948",
    description: "طلب إجازة مرضية",
    date: "2024-05-04 - 14:30:00",
  },
  {
    id: "#55947",
    description: "طلب ترقية",
    date: "2024-05-04 - 10:15:00",
  },
  {
    id: "#55946",
    description: "طلب تدريب داخلي",
    date: "2024-05-03 - 09:45:00",
  },
]
