'use server';

import type { NewsListRequest } from '@types';

export const getNewsList = async (): Promise<NewsListRequest[]> => {
  return NewsListDummyData;
};

const NewsListDummyData: NewsListRequest[] = [
  {
    id: 1,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-1.svg',
  },
  {
    id: 2,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-2.svg',
  },
  {
    id: 3,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-3.svg',
  },
  {
    id: 4,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-1.svg',
  },
  {
    id: 5,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-2.svg',
  },
  {
    id: 6,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-3.svg',
  },
  {
    id: 7,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-1.svg',
  },
  {
    id: 8,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-2.svg',
  },
  {
    id: 9,
    title: '"منشآت" تطلق جولة الامتياز التجاري أغسطس المقبل في 14 مدينة...',
    date: 'الجمعة 26 يوليو 2024',
    description:
      'نظمت الهية العامة للمنشآت الصغيرة والمتوطسة منشآت في مركز ذكا اليوم الحفل الختامي....',
    image: '/news-3.svg',
  },
];
