"use server"

import type { ObligationDetails } from "@types"

export const getObligationDetails =
  async (): Promise<ObligationDetails | void> => {
    try {
      const obligationDetails: ObligationDetails = {
        details: `انطلاقا من حرص الهيئة على المسائل المتصلة بالاستغلالية والتحيز من أجل
          المحافظة على سلامة أعمالها، وسمعتها وسمعة موظفيها وثقة الجمهور بها،
          وإبعاد كل ما من شأنه أن يوجد تضاربا للمصالح فيما يتصل بأعمالها أو لمن
          يقومون بتنفيذها أو اتخاذ قرار أو رأي بشأنها، فمن الضروري الكشف عن أي
          تضارب في المصالح واقع لك حاليا أو تحتمل وجوده مستقبلا بسبب دورك
          وأعمالك الوظيفية في الهيئة (سواء كنت موظفا أو كنت تحت إجراءات
          التعيين)، لتتمكن الهيئة من التعامل النظامي والأمثل في حال وجود تضارب
          في المصالح، لذا فقد تم إعداد هذا النموذج يناء على ما تضمنته المادة
          (الرابعة والعشرون) من الباب الخامس من مدونة قواعد السلوك الوظيفي
          وأخلاقيات الوظيفة لموظفي الهيئة الصادرة من محافظ الهيئة برقم (----)
          وتاريخ --/--/1440هــ، التي أوجبت على الموظف أن يفصح خطيا عن أي حالة
          تعارض مصالح سواء كانت حالّة أو محتملة.<br></br> وتضارب المصالح قد عرفته المدونة
          المشار إليها بأنه يمثل “الحالة التي تكون فيها مصلحة خاصة للموظف أو
          لغيره، مادية أو معنوية، مباشرة أو غير مباشرة، حالّة أو محتملة، تؤثر في
          موضوعيته وحياديته في إتخاذه قرارا أو إبدائه رأيا له علاقة بوظيفته”،
          ومن حالات تضارب المصالح -على سبيل المثال لا الحصر- ما يأتي:<br></br> 1- وجود
          مصلحة بينك وبين الجهة المتعاقدة أو التي بدأت في خطوات التعاقد مع
          الهيئة، متى كان لك دور واقع أو محتمل في ذلك التعاقد.<br></br> 2-وجود صلة قرابة
          حتى الدرجة (الرابعة) بينك وأي من موظفي الهيئة، أو أي شخص مرشح للحصول
          على وظيفة في الهيئة.<br></br> 3- وجود مصلحة مادية و/أو غير مادية أو معنوية،
          حالّة أو محتملة، بينك أو أي من أقاربك حتى الدرجة (الرابعة)، أو أي فرد
          أو جهة كانت (وتشمل على سبيل المثال لا الحصر: منشأة تجارية، أو حكومية،
          أو غير هادفة للربح)، لديها تعاقد أو اتفاقية أو مذكرة تفاهم، قائمة أو
          بدأت في خطوات التعاقد أو الاتفاق بأي شكل من أشكاله مع الهيئة.<br></br> ويدخل
          ضمن الأقارب حتى الدرجة (الرابعة) بحسب ما أشير إليه في اللائحة
          التنفيذية لنظام المرافعات الشرعية الصادرة بقرار وزير العدل رقم (39933)
          وتاريخ 19/5/1435هــ، كل من الآباء والأمهات والأجداد والجدات وإن علو،
          والأولاد وأولادهم وإن نزلوا، والزوج أو الزوجة، والإخوة والأخوات
          الأشقاء أو لأب أو لأم وأولادهم وأولاد أولادهم، والأعمام والعمات
          وأولادهم، والأخوال والخالات وأولادهم، كما تطبق الدرجات الأربع المذكورة
          آنفا على أقارب الزوج أو الزوجة وهم الأصهار.<br></br> كما أن الإفصاح عن الاشتباه
          بحالات تضارب المصالح، يعد بادرة إيجابية من الموظف المهني الملتزم
          بأخلاقيات الوظيفة، وأي إفصاح سيعامل بسرية تامة، وسيتم البث في مدى وجود
          تضارب للمصالح من عدمه من خلال الهيئة.
          `,
      }
      return obligationDetails
    } catch (error) {
      return
    }
  }
