"use server"

import type { PressFileDetails } from "@types"
import { getFetchHeaders } from "./getFetchHeaders"
import { NewsElementSchema, ResponseSchema } from "@api/schemas"
import { getDemo } from "../db/actions/getDemo"
import { formatDate } from "@utils"

export const getPressFileDetails = async (
  id: string,
): Promise<PressFileDetails | void> => {
  const isDemo = await getDemo()
  if (isDemo) return dummyData

  // ! VARIBLES
  // ! ==================================
  const url = "api/po/read/portal-news"
  const apiRootUrl = process.env.API_ROOT_URL as string
  const { headers } = await getFetchHeaders()
  const requestBody = {
    news_type: "news",
    news_id: id,
  }
  const requestBodyString = JSON.stringify(requestBody)
  const requestUrl = `${apiRootUrl}/${url}`

  // ! FETCH
  // ! ==================================
  const apiResponse = await fetch(requestUrl, {
    headers,
    method: "POST",
    body: requestBodyString,
  })
  const responseJson = await apiResponse.json()

  // ! VALIDATION
  // ! ==================================
  const validatedResponse = ResponseSchema.parse(responseJson)
  const { result } = validatedResponse
  const { data } = result
  const validatedData = NewsElementSchema.parse(data[0])

  // ! PARSING
  // ! ==================================

  const returnedData: PressFileDetails = {
    id: validatedData.id.toString(),
    title: validatedData.title,
    date: formatDate(validatedData.create_date),
    description: validatedData.description,
    imageUrl: `data:image/gif;base64,${validatedData.image}`,
  }
  return returnedData
}

const dummyData: PressFileDetails = {
  id: "602",
  date: "01.06.2024 - 07:54 صباحاً",
  imageUrl: "/article.svg",
  title:
    '"منشآت" تختتم أسبوع القانون بمناقشة أهم الفرص الداعمة لرواد الأعمال في قطاع القانون"',
  description: ` اختتمت الهيئة العامة للمنشآت الصغيرة والمتوسطة "منشآت" جولة الامتياز
        التجاري في محافظة الخبر من 12 وحتى 13 أغسطس، بشراكة مع وزارة التجارة
        وبرنامج التحول الوطني وبنك التنمية الاجتماعية وبنك المنشآت الصغيرة
        والمتوسطة، إلى جانب مشاركة عددٍ من الجهات الداعمة والممكنة؛ للتعريف
        بالخدمات والبرامج في مجال الامتياز التجاري، وذلك في مركز دعم المنشآت
        بالمحافظة.<br></br> وفي جلسة حوارية بعنوان البرامج والمنتجات
        المقدمة لمانحي وأصحاب الامتياز التجاري أكد رئيس مجلس إدارة غرفة
        الشرقية بدر الرزيزاء، أن الغرفة تركز على تنظيم العلاقة بين رواد
        الأعمال والجهات الداعمة، مشيراً إلى أن الغرفة احتضنت أول معرض للامتياز
        التجاري قبل 12 عاماً بالتعاون مع إحدى الشركات التجارية.<br></br>
        وبين أن غرفة الشرقية قدمت خدماتها لقطاع الأعمال لمدة تقارب
        70 عاماً، وركزت في السنوات الـ 15 الأخيرة بشكل خاص على الامتياز
        التجاري، وباعتبارها جهة غير تنفيذية وغير مانحة للتمويل، ركزت الغرفة
        على التوجيه والتوعية من خلال تنظيم ورش العمل والتعاون مع الجهات
        المختلفة، وتسعى إلى تعزيز التعاون مع الجهات الداعمة والممكنة لدعم رواد
        الأعمال.من جانبه، كشف المدير التنفيذي لتمويل المنشآت في بنك التنمية
        الاجتماعية فارس العبدالجبار أن إجمالي قيمة تمويل البنك للمنشآت الصغيرة
        والمتوسطة بلغ 140 مليون ريال، استفاد منها 145 منشأة في قطاع الامتياز
        التجاري، وتجاوزت العلامات التجارية المعتمدة لدى بنك التنمية الاجتماعية
        80 علامة.<br></br> وأوضح العبدالجبار أن بنك التنمية الاجتماعية أطلق
        أول منتج مخصص للامتياز التجاري في عام 2007، وصمم منتجاً حديثاً في عام
        2020 بضمانات وضعها في متناول الجميع، مفيدًا أن بنك التنمية قدم مسارين
        لرواد ورائدات الأعمال مسار تصنيعي لبناء خطة العمل، ومسارًا تمويليًا
        يشمل جميع البرامج والمنتجات التمويلية، كما قدم مساراً تأسيسياً لرائد
        الأعمال في مجال الامتياز التجاري.<br></br>يذكر أن جولة الامتياز
        التجاري تهدف إلى زيادة الوعي والثقافة عن الامتياز التجاري وجوانبه
        المختلفة متضمنة القانونية والتشغيلية والتسويقية، وتحفيز التوسع
        والاستثمار عبر نموذج عمل الامتياز التجاري والعمل على استعراض قصص
        نجاحها، وتوفير بيئة استثمارية متكاملة من خلال مشاركة الجهات الممكنة
        والاستشارية ومانحي العلامات التجارية وأصحاب الامتياز المحتملين.
        <br></br> وشارك في الجولة 40 علامة تجارية و7 جهات ممكنة
        وداعمة، لتمكين رواد الأعمال وأصحاب المنشآت الصغيرة والمتوسطة من التعرف
        على أهم الأساسيات في مجال الامتياز التجاري، كما عقدت الجولة عددًا من
        ورش العمل متضمنة اكتساب حقوق الامتياز وتقييم الفرص الاستثمارية،
        والتعريف بمركز الامتياز التجاري في "منشآت"، إلى جانب التعرف على
        إستراتيجيات السوق وآليات التوسع الدولي في الامتياز التجاري، وتطوير
        الأدلة التشغيلية للعلامات التجارية.<br></br> وتستكمل منشآت
        جولة الامتياز التجاري في مدينة أبها، التي تعد المحطة الثانية من أصل 14
        جولة حول المملكة؛ وذلك خلال الفترة 26 – 27 أغسطس؛ بهدف تعزيز وتنمية
        قطاع الامتياز التجاري، وتمكين رواد الأعمال من الوصول إلى جميع الخدمات
        والتسهيلات التي تقدمها الجهات المعنية.<br></br> وتحرص
        "منشآت" على تعزيز قدرات رواد الأعمال في مجال الامتياز التجاري، من خلال
        مبادرات وبرامج متخصصة، وذلك لأهميتها ودورها الفاعل في دعم قطاع المنشآت
        الصغيرة والمتوسطة، ويمكن للمهتمين التسجيل لحضور الجولة، عبر الرابط:
        `,
}
