export const pressFileData = [
  {
    title: '"منشآت" 1000 شركة ناشئة محلية ودولية تستعرض...',
    date: "01.06.2024 07:54 صباحًا",
    description:
      "نظمت الهيئة العامة للمنشآت الصغيرة والمتوسطة منشآت في مركز كذا اليوم...",
    image: "/sabq-image.svg",
  },
  {
    title: '"منشآت" 1000 شركة ناشئة محلية ودولية تستعرض...',
    date: "01.06.2024 07:54 صباحًا",
    description:
      "نظمت الهيئة العامة للمنشآت الصغيرة والمتوسطة منشآت في مركز كذا اليوم...",
    image: "/sabq-image.svg",
  },
  {
    title: '"منشآت" 1000 شركة ناشئة محلية ودولية تستعرض...',
    date: "01.06.2024 07:54 صباحًا",
    description:
      "نظمت الهيئة العامة للمنشآت الصغيرة والمتوسطة منشآت في مركز كذا اليوم...",
    image: "/sabq-image.svg",
  },
  {
    title: "منشآت 1000 شركة ناشطة محلية ودولية تستعرض...",
    date: "01.06.2024 07:54 صباحًا",
    description:
      "نظمت الهيئة العامة للمنشآت الصغيرة والمتوسطة منشآت في مركز كذا اليوم...",
    image: "/sabq-image.svg",
  },
]
