export const monshaatData = [
  {
    id: 1,
    title:
      'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله من مواليد ال...',
    date: '01.06.2024 - 07:54 صباحاً',
    image: '/monshaatFamily-1.svg',
  },
  {
    id: 2,
    title:
      'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله من مواليد ال...',
    date: '01.06.2024 - 07:54 صباحاً',
    image: '/monshaatFamily-2.svg',
  },
  {
    id: 3,
    title:
      'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله من مواليد ال...',
    date: '01.06.2024 - 07:54 صباحاً',
    image: '/monshaatFamily-3.svg',
  },
];

export const MonshaatCarouselData = [
  {
    title: 'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله ...',
    date: '01.06.2024 07:54 صباحًا',
    image: '/MonshaatFamily-4.svg',
  },
  {
    title: 'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله ...',
    date: '01.06.2024 07:54 صباحًا',
    image: '/MonshaatFamily-4.svg',
  },
  {
    title: 'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله ...',
    date: '01.06.2024 07:54 صباحًا',
    image: '/MonshaatFamily-4.svg',
  },
  {
    title: 'رزقت الزميلة: لمياء بنت عبدالله الربيعان بأحمد جعله الله ...',
    date: '01.06.2024 07:54 صباحًا',
    image: '/MonshaatFamily-4.svg',
  },
];
